huyzodz/FC/lib/inc/stm32h750vbt6.h
#ifndef _STM32H750VBT6_H_
#define _STM32H750VBT6_H_

#include <stdint.h>
#include "system_stm32h7xx.h"

#define __IO                volatile            /* read/write permission*/
#define __O                 volatile            /* write only */
#define __I                 volatile const      /* read only */

/*

                            struct define
*/

/* FLASH_TypdeDef */
typedef struct {
    __IO uint32_t ACR;             /*!< FLASH access control register,                            Address offset: 0x00  */
    __IO uint32_t KEYR1;           /*!< Flash Key Register for bank1,                             Address offset: 0x04  */
    __IO uint32_t OPTKEYR;         /*!< Flash Option Key Register,                                Address offset: 0x08  */
    __IO uint32_t CR1;             /*!< Flash Control Register for bank1,                         Address offset: 0x0C  */
    __IO uint32_t SR1;             /*!< Flash Status Register for bank1,                          Address offset: 0x10  */
    __IO uint32_t CCR1;            /*!< Flash Control Register for bank1,                         Address offset: 0x14  */
    __IO uint32_t OPTCR;           /*!< Flash Option Control Register,                            Address offset: 0x18  */
    __IO uint32_t OPTSR_CUR;       /*!< Flash Option Status Current Register,                     Address offset: 0x1C  */
    __IO uint32_t OPTSR_PRG;       /*!< Flash Option Status to Program Register,                  Address offset: 0x20  */
    __IO uint32_t OPTCCR;          /*!< Flash Option Clear Control Register,                      Address offset: 0x24  */
    __IO uint32_t PRAR_CUR1;       /*!< Flash Current Protection Address Register for bank1,      Address offset: 0x28  */
    __IO uint32_t PRAR_PRG1;       /*!< Flash Protection Address to Program Register for bank1,   Address offset: 0x2C  */
    __IO uint32_t SCAR_CUR1;       /*!< Flash Current Secure Address Register for bank1,          Address offset: 0x30  */
    __IO uint32_t SCAR_PRG1;       /*!< Flash Secure Address to Program Register for bank1,       Address offset: 0x34  */
    __IO uint32_t WPSN_CUR1;       /*!< Flash Current Write Protection Register on bank1,         Address offset: 0x38  */
    __IO uint32_t WPSN_PRG1;       /*!< Flash Write Protection to Program Register on bank1,      Address offset: 0x3C  */
    __IO uint32_t BOOT_CUR;        /*!< Flash Current Boot Address for Pelican Core Register,     Address offset: 0x40  */
    __IO uint32_t BOOT_PRG;        /*!< Flash Boot Address to Program for Pelican Core Register,  Address offset: 0x44  */
    uint32_t      RESERVED0[2];    /*!< Reserved, 0x48 to 0x4C                                                          */
    __IO uint32_t CRCCR1;          /*!< Flash CRC Control register For Bank1 Register ,           Address offset: 0x50  */
    __IO uint32_t CRCSADD1;        /*!< Flash CRC Start Address Register for Bank1 ,              Address offset: 0x54  */
    __IO uint32_t CRCEADD1;        /*!< Flash CRC End Address Register for Bank1 ,                Address offset: 0x58  */
    __IO uint32_t CRCDATA;         /*!< Flash CRC Data Register for Bank1 ,                       Address offset: 0x5C  */
    __IO uint32_t ECC_FA1;         /*!< Flash ECC Fail Address For Bank1 Register ,               Address offset: 0x60  */
    uint32_t      RESERVED1[40];   /*!< Reserved, 0x64 to 0x100                                                         */
    __IO uint32_t KEYR2;           /*!< Flash Key Register for bank2,                             Address offset: 0x104 */
    uint32_t      RESERVED2;       /*!< Reserved, 0x108                                                                 */
    __IO uint32_t CR2;             /*!< Flash Control Register for bank2,                         Address offset: 0x10C */
    __IO uint32_t SR2;             /*!< Flash Status Register for bank2,                          Address offset: 0x110 */
    __IO uint32_t CCR2;            /*!< Flash Status Register for bank2,                          Address offset: 0x114 */
    uint32_t      RESERVED3[4];    /*!< Reserved, 0x118 to 0x124                                                        */
    __IO uint32_t PRAR_CUR2;       /*!< Flash Current Protection Address Register for bank2,      Address offset: 0x128 */
    __IO uint32_t PRAR_PRG2;       /*!< Flash Protection Address to Program Register for bank2,   Address offset: 0x12C */
    __IO uint32_t SCAR_CUR2;       /*!< Flash Current Secure Address Register for bank2,          Address offset: 0x130 */
    __IO uint32_t SCAR_PRG2;       /*!< Flash Secure Address Register for bank2,                  Address offset: 0x134 */
    __IO uint32_t WPSN_CUR2;       /*!< Flash Current Write Protection Register on bank2,         Address offset: 0x138 */
    __IO uint32_t WPSN_PRG2;       /*!< Flash Write Protection to Program Register on bank2,      Address offset: 0x13C */
    uint32_t      RESERVED4[4];    /*!< Reserved, 0x140 to 0x14C                                                        */
    __IO uint32_t CRCCR2;          /*!< Flash CRC Control register For Bank2 Register ,           Address offset: 0x150 */
    __IO uint32_t CRCSADD2;        /*!< Flash CRC Start Address Register for Bank2 ,              Address offset: 0x154 */
    __IO uint32_t CRCEADD2;        /*!< Flash CRC End Address Register for Bank2 ,                Address offset: 0x158 */
    __IO uint32_t CRCDATA2;        /*!< Flash CRC Data Register for Bank2 ,                       Address offset: 0x15C */
    __IO uint32_t ECC_FA2;         /*!< Flash ECC Fail Address For Bank2 Register ,               Address offset: 0x160 */
} FLASH_TypeDef;



/* PWR_TypeDef */
typedef struct {
    __IO uint32_t CR1;       /*!< PWR power control register 1,            Address offset: 0x00 */
    __IO uint32_t CSR1;      /*!< PWR power control status register 1,     Address offset: 0x04 */
    __IO uint32_t CR2;       /*!< PWR power control register 2,            Address offset: 0x08 */
    __IO uint32_t CR3;       /*!< PWR power control register 3,            Address offset: 0x0C */
    __IO uint32_t CPUCR;     /*!< PWR CPU control register,                Address offset: 0x10 */
        uint32_t RESERVED0; /*!< Reserved,                                Address offset: 0x14 */
    __IO uint32_t D3CR;      /*!< PWR D3 domain control register,          Address offset: 0x18 */
        uint32_t RESERVED1; /*!< Reserved,                                Address offset: 0x1C */
    __IO uint32_t WKUPCR;    /*!< PWR wakeup clear register,               Address offset: 0x20 */
    __IO uint32_t WKUPFR;    /*!< PWR wakeup flag register,                Address offset: 0x24 */
    __IO uint32_t WKUPEPR;   /*!< PWR wakeup enable and polarity register, Address offset: 0x28 */
} PWR_TypeDef;



/* RCC_TypeDef */
typedef struct {
    __IO uint32_t CR;             /*!< RCC clock control register,                                              Address offset: 0x00  */
    __IO uint32_t HSICFGR;        /*!< HSI Clock Calibration Register,                                          Address offset: 0x04  */
    __IO uint32_t CRRCR;          /*!< Clock Recovery RC  Register,                                             Address offset: 0x08  */
    __IO uint32_t CSICFGR;        /*!< CSI Clock Calibration Register,                                          Address offset: 0x0C  */
    __IO uint32_t CFGR;           /*!< RCC clock configuration register,                                        Address offset: 0x10  */
    uint32_t     RESERVED1;       /*!< Reserved,                                                                Address offset: 0x14  */
    __IO uint32_t D1CFGR;         /*!< RCC Domain 1 configuration register,                                     Address offset: 0x18  */
    __IO uint32_t D2CFGR;         /*!< RCC Domain 2 configuration register,                                     Address offset: 0x1C  */
    __IO uint32_t D3CFGR;         /*!< RCC Domain 3 configuration register,                                     Address offset: 0x20  */
    uint32_t     RESERVED2;       /*!< Reserved,                                                                Address offset: 0x24  */
    __IO uint32_t PLLCKSELR;      /*!< RCC PLLs Clock Source Selection Register,                                Address offset: 0x28  */
    __IO uint32_t PLLCFGR;        /*!< RCC PLLs  Configuration Register,                                        Address offset: 0x2C  */
    __IO uint32_t PLL1DIVR;       /*!< RCC PLL1 Dividers Configuration Register,                                Address offset: 0x30  */
    __IO uint32_t PLL1FRACR;      /*!< RCC PLL1 Fractional Divider Configuration Register,                      Address offset: 0x34  */
    __IO uint32_t PLL2DIVR;       /*!< RCC PLL2 Dividers Configuration Register,                                Address offset: 0x38  */
    __IO uint32_t PLL2FRACR;      /*!< RCC PLL2 Fractional Divider Configuration Register,                      Address offset: 0x3C  */
    __IO uint32_t PLL3DIVR;       /*!< RCC PLL3 Dividers Configuration Register,                                Address offset: 0x40  */
    __IO uint32_t PLL3FRACR;      /*!< RCC PLL3 Fractional Divider Configuration Register,                      Address offset: 0x44  */
    uint32_t      RESERVED3;      /*!< Reserved,                                                                Address offset: 0x48  */
    __IO uint32_t  D1CCIPR;       /*!< RCC Domain 1 Kernel Clock Configuration Register                         Address offset: 0x4C  */
    __IO uint32_t  D2CCIP1R;      /*!< RCC Domain 2 Kernel Clock Configuration Register                         Address offset: 0x50  */
    __IO uint32_t  D2CCIP2R;      /*!< RCC Domain 2 Kernel Clock Configuration Register                         Address offset: 0x54  */
    __IO uint32_t  D3CCIPR;       /*!< RCC Domain 3 Kernel Clock Configuration Register                         Address offset: 0x58  */
    uint32_t      RESERVED4;      /*!< Reserved,                                                                Address offset: 0x5C  */
    __IO uint32_t  CIER;          /*!< RCC Clock Source Interrupt Enable Register                               Address offset: 0x60  */
    __IO uint32_t  CIFR;          /*!< RCC Clock Source Interrupt Flag Register                                 Address offset: 0x64  */
    __IO uint32_t  CICR;          /*!< RCC Clock Source Interrupt Clear Register                                Address offset: 0x68  */
    uint32_t     RESERVED5;       /*!< Reserved,                                                                Address offset: 0x6C  */
    __IO uint32_t  BDCR;          /*!< RCC Vswitch Backup Domain Control Register,                              Address offset: 0x70  */
    __IO uint32_t  CSR;           /*!< RCC clock control & status register,                                     Address offset: 0x74  */
    uint32_t     RESERVED6;       /*!< Reserved,                                                                Address offset: 0x78  */
    __IO uint32_t AHB3RSTR;       /*!< RCC AHB3 peripheral reset register,                                      Address offset: 0x7C  */
    __IO uint32_t AHB1RSTR;       /*!< RCC AHB1 peripheral reset register,                                      Address offset: 0x80  */
    __IO uint32_t AHB2RSTR;       /*!< RCC AHB2 peripheral reset register,                                      Address offset: 0x84  */
    __IO uint32_t AHB4RSTR;       /*!< RCC AHB4 peripheral reset register,                                      Address offset: 0x88  */
    __IO uint32_t APB3RSTR;       /*!< RCC APB3 peripheral reset register,                                      Address offset: 0x8C  */
    __IO uint32_t APB1LRSTR;      /*!< RCC APB1 peripheral reset Low Word register,                             Address offset: 0x90  */
    __IO uint32_t APB1HRSTR;      /*!< RCC APB1 peripheral reset High Word register,                            Address offset: 0x94  */
    __IO uint32_t APB2RSTR;       /*!< RCC APB2 peripheral reset register,                                      Address offset: 0x98  */
    __IO uint32_t APB4RSTR;       /*!< RCC APB4 peripheral reset register,                                      Address offset: 0x9C  */
    __IO uint32_t GCR;            /*!< RCC RCC Global Control  Register,                                        Address offset: 0xA0  */
    uint32_t     RESERVED8;       /*!< Reserved,                                                                Address offset: 0xA4  */
    __IO uint32_t D3AMR;          /*!< RCC Domain 3 Autonomous Mode Register,                                   Address offset: 0xA8  */
    uint32_t     RESERVED11[9];    /*!< Reserved, 0xAC-0xCC                                                      Address offset: 0xAC  */
    __IO uint32_t RSR;            /*!< RCC Reset status register,                                               Address offset: 0xD0  */
    __IO uint32_t AHB3ENR;        /*!< RCC AHB3 peripheral clock  register,                                     Address offset: 0xD4  */
    __IO uint32_t AHB1ENR;        /*!< RCC AHB1 peripheral clock  register,                                     Address offset: 0xD8  */
    __IO uint32_t AHB2ENR;        /*!< RCC AHB2 peripheral clock  register,                                     Address offset: 0xDC  */
    __IO uint32_t AHB4ENR;        /*!< RCC AHB4 peripheral clock  register,                                     Address offset: 0xE0  */
    __IO uint32_t APB3ENR;        /*!< RCC APB3 peripheral clock  register,                                     Address offset: 0xE4  */
    __IO uint32_t APB1LENR;       /*!< RCC APB1 peripheral clock  Low Word register,                            Address offset: 0xE8  */
    __IO uint32_t APB1HENR;       /*!< RCC APB1 peripheral clock  High Word register,                           Address offset: 0xEC  */
    __IO uint32_t APB2ENR;        /*!< RCC APB2 peripheral clock  register,                                     Address offset: 0xF0  */
    __IO uint32_t APB4ENR;        /*!< RCC APB4 peripheral clock  register,                                     Address offset: 0xF4  */
    uint32_t      RESERVED12;      /*!< Reserved,                                                                Address offset: 0xF8  */
    __IO uint32_t AHB3LPENR;      /*!< RCC AHB3 peripheral sleep clock  register,                               Address offset: 0xFC  */
    __IO uint32_t AHB1LPENR;      /*!< RCC AHB1 peripheral sleep clock  register,                               Address offset: 0x100 */
    __IO uint32_t AHB2LPENR;      /*!< RCC AHB2 peripheral sleep clock  register,                               Address offset: 0x104 */
    __IO uint32_t AHB4LPENR;      /*!< RCC AHB4 peripheral sleep clock  register,                               Address offset: 0x108 */
    __IO uint32_t APB3LPENR;      /*!< RCC APB3 peripheral sleep clock  register,                               Address offset: 0x10C */
    __IO uint32_t APB1LLPENR;     /*!< RCC APB1 peripheral sleep clock  Low Word register,                      Address offset: 0x110 */
    __IO uint32_t APB1HLPENR;     /*!< RCC APB1 peripheral sleep clock  High Word register,                     Address offset: 0x114 */
    __IO uint32_t APB2LPENR;      /*!< RCC APB2 peripheral sleep clock  register,                               Address offset: 0x118 */
    __IO uint32_t APB4LPENR;      /*!< RCC APB4 peripheral sleep clock  register,                               Address offset: 0x11C */
    uint32_t     RESERVED13[4];   /*!< Reserved, 0x120-0x12C                                                    Address offset: 0x120 */
} RCC_TypeDef;


/* Gpio_TypeDef */
typedef struct {
    __IO uint32_t MODER;    /*!< GPIO port mode register,               Address offset: 0x00      */
    __IO uint32_t OTYPER;   /*!< GPIO port output type register,        Address offset: 0x04      */
    __IO uint32_t OSPEEDR;  /*!< GPIO port output speed register,       Address offset: 0x08      */
    __IO uint32_t PUPDR;    /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
    __IO uint32_t IDR;      /*!< GPIO port input data register,         Address offset: 0x10      */
    __IO uint32_t ODR;      /*!< GPIO port output data register,        Address offset: 0x14      */
    __IO uint32_t BSRR;     /*!< GPIO port bit set/reset,               Address offset: 0x18      */
    __IO uint32_t LCKR;     /*!< GPIO port configuration lock register, Address offset: 0x1C      */
    __IO uint32_t AFR[2];   /*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
} GPIO_TypeDef;


/* TIM_TypeDef */
typedef struct {
    __IO uint32_t CR1;         /*!< TIM control register 1,                   Address offset: 0x00 */
    __IO uint32_t CR2;         /*!< TIM control register 2,                   Address offset: 0x04 */
    __IO uint32_t SMCR;        /*!< TIM slave mode control register,          Address offset: 0x08 */
    __IO uint32_t DIER;        /*!< TIM DMA/interrupt enable register,        Address offset: 0x0C */
    __IO uint32_t SR;          /*!< TIM status register,                      Address offset: 0x10 */
    __IO uint32_t EGR;         /*!< TIM event generation register,            Address offset: 0x14 */
    __IO uint32_t CCMR1;       /*!< TIM capture/compare mode register 1,      Address offset: 0x18 */
    __IO uint32_t CCMR2;       /*!< TIM capture/compare mode register 2,      Address offset: 0x1C */
    __IO uint32_t CCER;        /*!< TIM capture/compare enable register,      Address offset: 0x20 */
    __IO uint32_t CNT;         /*!< TIM counter register,                     Address offset: 0x24 */
    __IO uint32_t PSC;         /*!< TIM prescaler,                            Address offset: 0x28 */
    __IO uint32_t ARR;         /*!< TIM auto-reload register,                 Address offset: 0x2C */
    __IO uint32_t RCR;         /*!< TIM repetition counter register,          Address offset: 0x30 */
    __IO uint32_t CCR1;        /*!< TIM capture/compare register 1,           Address offset: 0x34 */
    __IO uint32_t CCR2;        /*!< TIM capture/compare register 2,           Address offset: 0x38 */
    __IO uint32_t CCR3;        /*!< TIM capture/compare register 3,           Address offset: 0x3C */
    __IO uint32_t CCR4;        /*!< TIM capture/compare register 4,           Address offset: 0x40 */
    __IO uint32_t BDTR;        /*!< TIM break and dead-time register,         Address offset: 0x44 */
    __IO uint32_t DCR;         /*!< TIM DMA control register,                 Address offset: 0x48 */
    __IO uint32_t DMAR;        /*!< TIM DMA address for full transfer,        Address offset: 0x4C */
    uint32_t      RESERVED1;   /*!< Reserved, 0x50                                                 */
    __IO uint32_t CCMR3;       /*!< TIM capture/compare mode register 3,      Address offset: 0x54 */
    __IO uint32_t CCR5;        /*!< TIM capture/compare register5,            Address offset: 0x58 */
    __IO uint32_t CCR6;        /*!< TIM capture/compare register6,            Address offset: 0x5C */
    __IO uint32_t AF1;         /*!< TIM alternate function option register 1, Address offset: 0x60 */
    __IO uint32_t AF2;         /*!< TIM alternate function option register 2, Address offset: 0x64 */
    __IO uint32_t TISEL;       /*!< TIM Input Selection register,             Address offset: 0x68 */
} TIM_TypeDef;


