huyzodz/FC/lib/inc/stm32h750vbt6.h
/* DMA_TypeDef */
typedef struct {
    __IO uint32_t LISR;   /*!< DMA low interrupt status register,      Address offset: 0x00 */
    __IO uint32_t HISR;   /*!< DMA high interrupt status register,     Address offset: 0x04 */
    __IO uint32_t LIFCR;  /*!< DMA low interrupt flag clear register,  Address offset: 0x08 */
    __IO uint32_t HIFCR;  /*!< DMA high interrupt flag clear register, Address offset: 0x0C */
} DMA_TypeDef;

/* DMA_Stream_TypeDef */
typedef struct {
  __IO uint32_t CR;     /*!< DMA stream x configuration register      */
  __IO uint32_t NDTR;   /*!< DMA stream x number of data register     */
  __IO uint32_t PAR;    /*!< DMA stream x peripheral address register */
  __IO uint32_t M0AR;   /*!< DMA stream x memory 0 address register   */
  __IO uint32_t M1AR;   /*!< DMA stream x memory 1 address register   */
  __IO uint32_t FCR;    /*!< DMA stream x FIFO control register       */
} DMA_Stream_TypeDef;

/* DMAMAX_Channel_Typdef*/
typedef struct {
  __IO uint32_t  CCR;        /*!< DMA Multiplexer Channel x Control Register   */
}DMAMUX_Channel_TypeDef;

/* USART_TypeDef */
typedef struct {
    __IO uint32_t CR1;    /*!< USART Control register 1,                 Address offset: 0x00 */
    __IO uint32_t CR2;    /*!< USART Control register 2,                 Address offset: 0x04 */
    __IO uint32_t CR3;    /*!< USART Control register 3,                 Address offset: 0x08 */
    __IO uint32_t BRR;    /*!< USART Baud rate register,                 Address offset: 0x0C */
    __IO uint32_t GTPR;   /*!< USART Guard time and prescaler register,  Address offset: 0x10 */
    __IO uint32_t RTOR;   /*!< USART Receiver Time Out register,         Address offset: 0x14 */
    __IO uint32_t RQR;    /*!< USART Request register,                   Address offset: 0x18 */
    __IO uint32_t ISR;    /*!< USART Interrupt and status register,      Address offset: 0x1C */
    __IO uint32_t ICR;    /*!< USART Interrupt flag Clear register,      Address offset: 0x20 */
    __IO uint32_t RDR;    /*!< USART Receive Data register,              Address offset: 0x24 */
    __IO uint32_t TDR;    /*!< USART Transmit Data register,             Address offset: 0x28 */
    __IO uint32_t PRESC;  /*!< USART clock Prescaler register,           Address offset: 0x2C */
} USART_TypeDef;



/* I2C_Typdef */
typedef struct {
    __IO uint32_t CR1;      /*!< I2C Control register 1,            Address offset: 0x00 */
    __IO uint32_t CR2;      /*!< I2C Control register 2,            Address offset: 0x04 */
    __IO uint32_t OAR1;     /*!< I2C Own address 1 register,        Address offset: 0x08 */
    __IO uint32_t OAR2;     /*!< I2C Own address 2 register,        Address offset: 0x0C */
    __IO uint32_t TIMINGR;  /*!< I2C Timing register,               Address offset: 0x10 */
    __IO uint32_t TIMEOUTR; /*!< I2C Timeout register,              Address offset: 0x14 */
    __IO uint32_t ISR;      /*!< I2C Interrupt and status register, Address offset: 0x18 */
    __IO uint32_t ICR;      /*!< I2C Interrupt clear register,      Address offset: 0x1C */
    __IO uint32_t PECR;     /*!< I2C PEC register,                  Address offset: 0x20 */
    __IO uint32_t RXDR;     /*!< I2C Receive data register,         Address offset: 0x24 */
    __IO uint32_t TXDR;     /*!< I2C Transmit data register,        Address offset: 0x28 */
} I2C_TypeDef;


/* EXTI_TypeDef */
typedef struct {
    __IO uint32_t RTSR1;               /*!< EXTI Rising trigger selection register,          Address offset: 0x00 */
    __IO uint32_t FTSR1;               /*!< EXTI Falling trigger selection register,         Address offset: 0x04 */
    __IO uint32_t SWIER1;              /*!< EXTI Software interrupt event register,          Address offset: 0x08 */
    __IO uint32_t D3PMR1;              /*!< EXTI D3 Pending mask register, (same register as to SRDPMR1) Address offset: 0x0C */
    __IO uint32_t D3PCR1L;             /*!< EXTI D3 Pending clear selection register low, (same register as to SRDPCR1L)     Address offset: 0x10 */
    __IO uint32_t D3PCR1H;             /*!< EXTI D3 Pending clear selection register High, (same register as to SRDPCR1H)   Address offset: 0x14 */
    uint32_t      RESERVED1[2];        /*!< Reserved,                                        0x18 to 0x1C         */
    __IO uint32_t RTSR2;               /*!< EXTI Rising trigger selection register,          Address offset: 0x20 */
    __IO uint32_t FTSR2;               /*!< EXTI Falling trigger selection register,         Address offset: 0x24 */
    __IO uint32_t SWIER2;              /*!< EXTI Software interrupt event register,          Address offset: 0x28 */
    __IO uint32_t D3PMR2;              /*!< EXTI D3 Pending mask register, (same register as to SRDPMR2) Address offset: 0x2C */
    __IO uint32_t D3PCR2L;             /*!< EXTI D3 Pending clear selection register low, (same register as to SRDPCR2L)  Address offset: 0x30 */
    __IO uint32_t D3PCR2H;             /*!< EXTI D3 Pending clear selection register High, (same register as to SRDPCR2H) Address offset: 0x34 */
    uint32_t      RESERVED2[2];        /*!< Reserved,                                        0x38 to 0x3C         */
    __IO uint32_t RTSR3;               /*!< EXTI Rising trigger selection register,          Address offset: 0x40 */
    __IO uint32_t FTSR3;               /*!< EXTI Falling trigger selection register,         Address offset: 0x44 */
    __IO uint32_t SWIER3;              /*!< EXTI Software interrupt event register,          Address offset: 0x48 */
    __IO uint32_t D3PMR3;              /*!< EXTI D3 Pending mask register, (same register as to SRDPMR3) Address offset: 0x4C */
    __IO uint32_t D3PCR3L;             /*!< EXTI D3 Pending clear selection register low, (same register as to SRDPCR3L) Address offset: 0x50 */
    __IO uint32_t D3PCR3H;             /*!< EXTI D3 Pending clear selection register High, (same register as to SRDPCR3H) Address offset: 0x54 */
    uint32_t      RESERVED3[10];       /*!< Reserved,                                        0x58 to 0x7C         */
    __IO uint32_t IMR1;                /*!< EXTI Interrupt mask register,                    Address offset: 0x80 */
    __IO uint32_t EMR1;                /*!< EXTI Event mask register,                        Address offset: 0x84 */
    __IO uint32_t PR1;                 /*!< EXTI Pending register,                           Address offset: 0x88 */
    uint32_t      RESERVED4;           /*!< Reserved,                                        0x8C                 */
    __IO uint32_t IMR2;                /*!< EXTI Interrupt mask register,                    Address offset: 0x90 */
    __IO uint32_t EMR2;                /*!< EXTI Event mask register,                        Address offset: 0x94 */
    __IO uint32_t PR2;                 /*!< EXTI Pending register,                           Address offset: 0x98 */
    uint32_t      RESERVED5;           /*!< Reserved,                                        0x9C                 */
    __IO uint32_t IMR3;                /*!< EXTI Interrupt mask register,                    Address offset: 0xA0 */
    __IO uint32_t EMR3;                /*!< EXTI Event mask register,                        Address offset: 0xA4 */
    __IO uint32_t PR3;                 /*!< EXTI Pending register,                           Address offset: 0xA8 */

