huyzodz/FC/lib/inc/stm32h750vbt6.h
/* look in mem map in ref */
/*
                        Base address define
*/
/* base address of RCC */
#define RCC_BASE                    (0x58024400UL)      

/* base address of PWR */
#define PWR_BASE                    (0x58024800UL)


/* base address of FLASH*/
#define FLASH_BASE                  (0x52002000UL)

/* base address of EXTI */
#define EXTI_BASE                   (0x58000000UL)

/* base address off GPIO */
#define GPIOK_BASE                  (0x58022800UL)
#define GPIOJ_BASE                  (0x58022400UL)
#define GPIOI_BASE                  (0x58022000UL)
#define GPIOH_BASE                  (0x58021C00UL)
#define GPIOG_BASE                  (0x58021800UL)
#define GPIOF_BASE                  (0x58021400UL)
#define GPIOE_BASE                  (0x58021000UL)
#define GPIOD_BASE                  (0x58020C00UL)
#define GPIOC_BASE                  (0x58020800UL)
#define GPIOB_BASE                  (0x58020400UL)
#define GPIOA_BASE                  (0x58020000UL)

/* base address of timer */
#define TIM14_BASE                  (0x40002000UL)
#define TIM13_BASE                  (0x40001C00UL)
#define TIM12_BASE                  (0x40001800UL)
#define TIM7_BASE                   (0x40001400UL)
#define TIM6_BASE                   (0x40001000UL)
#define TIM5_BASE                   (0x40000C00UL)
#define TIM4_BASE                   (0x40000800UL)
#define TIM3_BASE                   (0x40000400UL)
#define TIM2_BASE                   (0x40000000UL)


/* base address of advance timer */
#define TIM8_BASE                   (0x40010400UL)
#define TIM1_BASE                   (0x40010000UL)

/* base address of dma */
#define DMA2_BASE                   (0x40020400UL)
#define DMA1_BASE                   (0x40020000UL)

#define DMA1_Stream0_BASE     (DMA1_BASE + 0x010UL)
#define DMA1_Stream1_BASE     (DMA1_BASE + 0x028UL)
#define DMA1_Stream2_BASE     (DMA1_BASE + 0x040UL)
#define DMA1_Stream3_BASE     (DMA1_BASE + 0x058UL)
#define DMA1_Stream4_BASE     (DMA1_BASE + 0x070UL)
#define DMA1_Stream5_BASE     (DMA1_BASE + 0x088UL)
#define DMA1_Stream6_BASE     (DMA1_BASE + 0x0A0UL)
#define DMA1_Stream7_BASE     (DMA1_BASE + 0x0B8UL)

#define DMA2_Stream0_BASE     (DMA2_BASE + 0x010UL)
#define DMA2_Stream1_BASE     (DMA2_BASE + 0x028UL)
#define DMA2_Stream2_BASE     (DMA2_BASE + 0x040UL)
#define DMA2_Stream3_BASE     (DMA2_BASE + 0x058UL)
#define DMA2_Stream4_BASE     (DMA2_BASE + 0x070UL)
#define DMA2_Stream5_BASE     (DMA2_BASE + 0x088UL)
#define DMA2_Stream6_BASE     (DMA2_BASE + 0x0A0UL)
#define DMA2_Stream7_BASE     (DMA2_BASE + 0x0B8UL)


/* base address of DMAMUX1 */
#define DMAMUX1_BASE             (0x40020800UL)
#define DMAMUX1_Channel0_BASE    (DMAMUX1_BASE)
#define DMAMUX1_Channel1_BASE    (DMAMUX1_BASE + 0x0004UL)
#define DMAMUX1_Channel2_BASE    (DMAMUX1_BASE + 0x0008UL)
#define DMAMUX1_Channel3_BASE    (DMAMUX1_BASE + 0x000CUL)
#define DMAMUX1_Channel4_BASE    (DMAMUX1_BASE + 0x0010UL)
#define DMAMUX1_Channel5_BASE    (DMAMUX1_BASE + 0x0014UL)
#define DMAMUX1_Channel6_BASE    (DMAMUX1_BASE + 0x0018UL)
#define DMAMUX1_Channel7_BASE    (DMAMUX1_BASE + 0x001CUL)
#define DMAMUX1_Channel8_BASE    (DMAMUX1_BASE + 0x0020UL)
#define DMAMUX1_Channel9_BASE    (DMAMUX1_BASE + 0x0024UL)
#define DMAMUX1_Channel10_BASE   (DMAMUX1_BASE + 0x0028UL)
#define DMAMUX1_Channel11_BASE   (DMAMUX1_BASE + 0x002CUL)
#define DMAMUX1_Channel12_BASE   (DMAMUX1_BASE + 0x0030UL)
#define DMAMUX1_Channel13_BASE   (DMAMUX1_BASE + 0x0034UL)
#define DMAMUX1_Channel14_BASE   (DMAMUX1_BASE + 0x0038UL)
#define DMAMUX1_Channel15_BASE   (DMAMUX1_BASE + 0x003CUL)



/* base address of uasrt*/
#define USART6_BASE                 (0x40011400UL)
#define USART1_BASE                 (0x40011000UL)
#define USART3_BASE                 (0x40004800UL)
#define USART2_BASE                 (0x40004400UL)

/* base address of i2c */
#define I2C1_BASE                   (0x40005400UL)
#define I2C2_BASE                   (0x40005800UL)
#define I2C3_BASE                   (0x40005C00UL)
#define I2C4_BASE                   (0x58001C00UL)


/* base address of spi */
#define SPI1_BASE                   (0x40013000UL)
#define SPI2_BASE                   (0x40003800UL)
#define SPI3_BASE                   (0x40003C00UL)
#define SPI4_BASE                   (0x40013400UL)
#define SPI5_BASE                   (0x40015000UL)
#define SPI6_BASE                   (0x58001400UL)



/*
                        Define reg for use
*/

/* reg for RCC*/
#define RCC                         ((RCC_TypeDef*) RCC_BASE)

/* reg for PWR */
#define PWR                         ((PWR_TypeDef*) PWR_BASE)

/* reg for GPIO */
#define GPIOK                       ((GPIO_TypeDef*) GPIOK_BASE)
#define GPIOJ                       ((GPIO_TypeDef*) GPIOJ_BASE)
#define GPIOI                       ((GPIO_TypeDef*) GPIOI_BASE)
#define GPIOH                       ((GPIO_TypeDef*) GPIOH_BASE)
#define GPIOG                       ((GPIO_TypeDef*) GPIOG_BASE)
#define GPIOF                       ((GPIO_TypeDef*) GPIOF_BASE)
#define GPIOE                       ((GPIO_TypeDef*) GPIOE_BASE)
#define GPIOD                       ((GPIO_TypeDef*) GPIOD_BASE)
#define GPIOC                       ((GPIO_TypeDef*) GPIOC_BASE)
#define GPIOB                       ((GPIO_TypeDef*) GPIOB_BASE)
#define GPIOA                       ((GPIO_TypeDef*) GPIOA_BASE)

/* reg for timer */
#define TIM14                       ((TIM_TypeDef*) TIM14_BASE)
#define TIM13                       ((TIM_TypeDef*) TIM13_BASE)
#define TIM12                       ((TIM_TypeDef*) TIM12_BASE)
#define TIM7                        ((TIM_TypeDef*) TIM7_BASE)
#define TIM6                        ((TIM_TypeDef*) TIM6_BASE)
#define TIM5                        ((TIM_TypeDef*) TIM5_BASE)
#define TIM4                        ((TIM_TypeDef*) TIM4_BASE)
#define TIM3                        ((TIM_TypeDef*) TIM3_BASE)
#define TIM2                        ((TIM_TypeDef*) TIM2_BASE)

/* reg for advance timer */
#define TIM1                        ((TIM_TypeDef*) TIM1_BASE)
#define TIM8                        ((TIM_TypeDef*) TIM8_BASE)

